Tutorials/mulesQHDFoam/2D/backwardFacingStep/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(U|p)"
    {
        solver         PCG;
        preconditioner DIC;
        tolerance      1e-9;
        relTol         0;
    }
    T
    {
	$p;
	nAlphaCorr	1;
	nAlphaSubCycles	1;
    }
}

// ************************************************************************* //
